# Viscosity Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
PipePressureDropData..::..Viscosity Property
PipePressureDropData Class See Also
---
The viscosity of the pipe. Units: (kg/(ft·s)).
**Namespace:** Autodesk.Revit.DB.Plumbing**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public double Viscosity { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Viscosity As Double
	Get
```

Visual C++
---
```text
public:
property double Viscosity {
	double get ();
}
```

# See Also
PipePressureDropData Class
Autodesk.Revit.DB.Plumbing Namespace